{
    "coverLetter": "",
    "meta": {
        "theme": "Paper",
        "language": "es"
    },
    "basics": {
        "name": "Juan Pablo Retamales Lepe",
        "label": "Ingeniero de Machine Learning Operations",
        "email": "jua.retamales@gmail.com",
        "phone": "+56 951 170 428",
        "url": "https://www.juanretamales.cl",
        "summary": "Ingeniero de Machine Learning Operations con experiencia en desarrollo, despliegue y optimización de soluciones de Inteligencia Artificial. Especializado en AWS, Azure y DigitalOcean, con habilidades en contenedores, ETL y creación de API. Líder de equipos, capacitador y gestor de proyectos ágil. Éxito demostrado en automatización, desarrollo de modelos ML y soluciones innovadoras en análisis de imágenes. Experto en gestión de infraestructura en la nube y metodologías ágiles, centrado en la eficiencia y el rendimiento.",
        "location": {
            "city": "Santiago",
            "countryCode": "Chile",
            "region": "Región Metropolitana"
        },
        "profiles": [
            {
                "network": "Github",
                "username": "juanretamales",
                "url": "https://github.com/juanretamales"
            },
            {
                "network": "Linkedin",
                "username": "in/juanretamales",
                "url": "https://www.linkedin.com/in/juanretamales/"
            }
        ]
    },
    "work": [
        {
            "name": "Digitaltex Spa",
            "position": "Ingeniero de Machine Learning Operations",
            "url": "https://digitaltex.cl",
            "startDate": "2022-09-01",
            "endDate": "",
            "summary": "Líder en inteligencia artificial especializado en entrenamiento y despliegue de modelos, liderando equipos para desarrollar soluciones innovadoras en este ámbito.",
            "highlights": [
                "Desarrollo de soluciones informáticas basadas en inteligencia artificial, trabajando en la automatización de tareas, desarrollos de API's y enviar a producción los modelos ML.",
                "Responsable del respaldo versionado de conjuntos de datos, modelos de inteligencia artificial y código asociado. Líder del equipo de etiquetado para la creación de conjuntos de datos.",
                "Creación de una aplicación personalizada centrada en Active Learning para corregir y entrenar modelos de Machine Learning, incluyendo LayoutModel, detección y reconocimiento en imágenes. Proyectos notables incluyen extractores de información para boletas, facturas y otros documentos, así como la detección y reconocimiento de firmas, letreros y códigos en imágenes.",
                "Desarrollo de soluciones informáticas basadas en el uso de LLM para la creación de asistentes virtuales especializados centrados en la búsqueda selectiva de información en documentos específicos, así como en la extracción inteligente de información desde documentos y correos electrónicos.",
                "Despliegue de contenedores de AWS y Digital Ocean para arquitecturas distribuidas. Incluidas aplicaciones escalables con Beanstalk",
                "Entrenamiento y capacitación de nuevo personal en área TI, con énfasis en metodología de trabajo AGIL con Scrum y Kanban, junto a metodología de versiones con Git Flow."
            ]
        },
        {
            "name": "Freelance",
            "position": "Desarrollador de aplicaciones y consultor",
            "startDate": "2023-01-01",
            "endDate": "",
            "summary": "Además, en mi tiempo libre, genero ingresos adicionales mediante el desarrollo de aplicaciones y la prestación de servicios de consultoría",
            "highlights": [
                "Desarrollo de sitio en django para el registro y salida de contenedores, y la generación dentro del sitio de un dashboard para medir la eficiencia.",
                "Creación de una automatización para la creación de reportes en Excel basado en reglas y Outlook desde distintas bases de datos.",
                "Creación de una API para Tercop para consumo externo con excelentes resultados. El sitio actuaba de ETL para otorgar información a los clientes.",
                "Administrador y consultor para los servicios de Azure a Tercop"
            ]
        },
        {
            "name": "Sunai Spa",
            "position": "Analista de datos y desarrollador de aplicaciones",
            "url": "https://sunai.cl",
            "startDate": "2021-10-01",
            "endDate": "2022-08-30",
            "summary": "Mi papel en la empresa se centraba en el desarrollo de soluciones ETL para la consolidación de datos provenientes de diversas plantas solares, facilitando mediciones precisas y ofreciendo recomendaciones fundamentadas",
            "highlights": [
                "Experiencia trabajando con la obtención de datos desde múltiples fuentes de datos, principalmente APIs y archivos CSV a través de ETL’s personalizados escrito en Python, así como también conocimientos básicos de los servicios AWS de Amazon.",
                "Líder de proyecto de Inteligencia artificial para un sistema de detección y reconocimiento de fallas en paneles fotovoltaicos mediante análisis de imágenes térmicas georreferenciadas, de plantas solares. ",
                "Además, de crear automatizaciones con Python, gestionar y coordinar diversos scripts con el controlador de tareas automáticas Jenkins. ",
                "Finalmente, experiencia en metodología SCRUM-Kanban en un marco colaborativo de trabajo remoto con la plataforma Jira y el sistema de versionamiento de archivos Git para trabajar con Gitlab."
            ]
        },
        {
            "name": "Freelance",
            "position": "Cientifico de datos y automatizador de tareas",
            "startDate": "2021-01-01",
            "endDate": "2021-11-30",
            "summary": "Además, mientras completo mis estudios, genero ingresos adicionales mediante el desarrollo de aplicaciones",
            "highlights": [
                "Creación de una automatización para la creación de reportes en Excel y Outlook desde distintas bases de datos.",
                "Creación de un ETL personalizado con scraper del portal de Lukas Lok Spa, destinado a la generación de reportes para los diversos clientes de estos.",
                "La automatización de descarga de reportes de distintos sitios bancarios y de delivery para realizar cuadraturas de caja mediante un ETL personalizado. ",
                "También de la publicación de la biblioteca 'DataframeToDB' en el repositorio oficial de Python pypi, el cual ayuda en la exportación de datos a bases de datos relacionales."
            ]
        }
    ],
    "volunteer": [],
    "education": [
        {
            "institution": "Universidad de Santiago de Chile",
            "url": "https://www.usach.cl/",
            "area": "Ciencias de la Computación",
            "studyType": "Ingeniero Civil en Informática",
            "startDate": "2016-01-01",
            "endDate": "2019-01-01",
            "courses": []
        },
        {
            "institution": "DUOC UC",
            "url": "https://www.duoc.cl/",
            "area": " Informática y Telecomunicaciones",
            "studyType": "Ingeniero en Informática",
            "startDate": "2012-01-01",
            "endDate": "2014-01-01",
            "courses": []
        }
    ],
    "awards": [
    ],
    "publications": [],
    "skills": [
        {
            "name": "Trabajo en equipo",
            "keywords": [
                "Liderasgo",
                "SCRUM",
                "Kanban"
            ]
        },
        {
            "name": "Programación",
            "keywords": [
                "Python",
                "FastAPI",
                "Django",
                "Github",
                "Gitglow",
                "PEP8"
            ]
        },
        {
            "name": "Machine Learning",
            "keywords": [
                "Huggingface",
                "Pytorch",
                "Yolo",
                "LLM",
                "LayoutLMv3"
            ]
        },
        {
            "name": "Ciencias de Datos",
            "keywords": [
                "Pandas",
                "SQL",
                "ETL",
                "Grafana",
                "PowerBI"
            ]
        },
        {
            "name": "DevOps",
            "keywords": [
                "AWS",
                "EC2",
                "S3",
                "BeansTalk",
                "Azure",
                "Digital Ocean"
            ]
        }
    ],
    "languages": [
        {
            "language": "Español",
            "fluency": "Nativo"
        },
        {
            "language": "Ingles",
            "fluency": "Medio"
        }
    ],
    "interests": [],
    "references": [],
    "projects": [
        {
            "name": "Extracción de informacion y conciliador en documentos financieros con LLM",
            "startDate": "2024",
            "endDate": "",
            "description": "El proyecto tiene como objetivo principal implementar un sistema de extracción de información financiera desde documentos semi-estructurados utilizando el modelo de lenguaje mixtral-7b. La iniciativa busca alcanzar una precisión del 90% en la extracción de datos. Además, se incluye la extracción de tablas desde correos electrónicos para realizar conciliación y detectar posibles discrepancias entre los documentos procesados y la información reportada en los emails. La utilización de Mixtral-7b se debe a la necesidad de mantener la confidencialidad de los documentos procesados, evitando la salida de información de la intranet. Finalmente, generar un reporte en excel para el uso interno del equipo del cliente.",
            "highlights": [],
            "url": ""
        },
        {
            "name": "Automatización de Verificación de Domicilio mediante Lectura de Boletas de Servicios",
            "startDate": "2023",
            "description": "En este proyecto, lideré un proyecto exitoso que se centró en la automatización de la verificación de domicilio mediante la lectura de boletas de servicios básicos. Implementamos un layout parser para identificar de manera precisa el nombre de la persona, el RUT, el domicilio y la fecha de emisión. Este enfoque permitió acelerar significativamente el proceso de verificación, mejorando la eficiencia operativa y asegurando la calidad de los datos.",
            "highlights": []
        },
        {
            "name": "Extracción de informacion y conciliador en permisos de circulación",
            "startDate": "2023",
            "endDate": "",
            "description": "El proyecto se centró en acelerar el proceso de conciliación de permisos de circulación, integrando la información de documentos clave como el permiso de circulación, certificado de revisión técnica y de gases, y el seguro obligatorio (SOAP). un layout parser específico para cada tipo de documento, permitiendo la extracción precisa de información y asegurando la eficiencia del proceso, un cortador basado en YOLOv8 para separar documentos en una página, un modelos para clasificar el tipo de documento. Además, se integró la detección de códigos QR para validación externa.",
            "highlights": [],
            "url": ""
        },
        {
            "name": "Sistema detector de señaleticas viales",
            "startDate": "2022",
            "description": "El proyecto se enfocó en desarrollar e implementar un sistema altamente eficiente para la clasificación automática de señales a través de videos georreferenciados, con el objetivo de reducir significativamente el tiempo dedicado a generar y analizar informes manuales sobre el estado de dichas señaléticas.",
            "highlights": [],
            "url": ""
        },
        {
            "name": "Sistema detector de Hotspot en plantas solares",
            "startDate": "2022",
            "endDate": "",
            "description": "El proyecto se enfoca en el análisis imágenes térmicas de plantas solares, identificar mesas y detectar hotspots de manera precisa. La detección temprana de hotspots puede ayudar a prevenir daños mayores en los paneles solares y garantizar un rendimiento óptimo de los sistemas fotovoltaicos.",
            "highlights": [],
            "url": ""
        }
    ],
    "certificates": [
        {
            "name": "Git, GitHub, GitLab y GitHub Copilot: Uso de repositorios",
            "date": "2024-04-25",
            "issuer": "Udemy",
            "url": "https://www.udemy.com/certificate/UC-d388f9eb-2877-468c-94fe-a72fa7c35f71/"
        },
        {
            "name": "Data Analysis with Python",
            "date": "2024-04-24",
            "issuer": "FreeCodeCamp",
            "url": "https://www.freecodecamp.org/certification/JuanRetamales/data-analysis-with-python-v7"
        },
        {
            "name": "Python Mega Course : Go Beginner to Expert in Python3",
            "date": "2021-04-19",
            "issuer": "Udemy",
            "url": "https://www.udemy.com/certificate/UC-a7f58a9a-31e2-453d-958a-d5339c96e41b/"
        }
    ]
}